InformationRegisters/ПриложенияКРасчетуНалогаНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПриложенияКРасчетуНалогаНаПрибыль</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеВычетаемыеРасходыВключаемыеНОБ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения3</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение1</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериода</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения4</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение3</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УменьшениеНОБ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения7</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение5</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасходыПериода</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПриложенияКРасчетуНалогаНаПрибыль/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	Для каждого СтрокаРегистра Из ЭтотОбъект Цикл 
		Если СтрокаРегистра.НеВычетаемыеРасходыВключаемыеНОБ Тогда 
			ПроверяемыеРеквизиты.добавить("СтрокаПриложения3");
		КонецЕсли;	
		
		Если СтрокаРегистра.НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериода Тогда 
			ПроверяемыеРеквизиты.добавить("СтрокаПриложения4");
		КонецЕсли;
		
		Если СтрокаРегистра.УменьшениеНОБ Тогда 
			ПроверяемыеРеквизиты.добавить("СтрокаПриложения7");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
